# lesson4
Урок 4. Методы, стек вызовов. Стандартные методы классов .Net
Задание 1
Написать метод GetFullName(string firstName, string lastName, string patronymic), 
принимающий на вход ФИО в разных аргументах и возвращающий объединённую строку с ФИО. 
Используя метод, написать программу, выводящую в консоль 3–4 разных ФИО.
не стал усложнять,
Задание 2
Написать программу, принимающую на вход строку — набор чисел, 
разделенных пробелом, и возвращающую число — сумму всех чисел в строке. 
Ввести данные с клавиатуры и вывести результат на экран.
Больше всего времени провозился с этой задачей оп 2 причинам: 
Сначала выстраивал алгоритм создания метода в рамках которого при прохождении 
цикла программа будет заменять элемент стрингового массива " " на 0 и создавать стринговый массив из чисел и 0, 
элементы которого потом будут сконверитированы в int и далее суммированы. 
Простое лобовое решение, но читая MSDN столкнулся с функцией Split и она 
показалась более элегантной, однако внятного ее описания не нашлось и пришлось выстраивать синтаксис 
методом научного тыка, получилось, но задача заняла 8 часов... too much.
Задание 3
сама по себе задача интересная, очень и в MSDN приведены множество аналогов
добился решения через уже много раз использованные Console.WriteLine, но увидел функцию 
вызова иссключения throw new ArgumentException (https://docs.microsoft.com/ru-ru/dotnet/csharp/language-reference/keywords/throw), 
получилось красивше
Задание 4
Написать программу, вычисляющую число Фибоначчи для заданного значения рекурсивным способом
как понял задание, был еще вариант вывести значение для заданного количества итераций 
через создание метода GetFib (int i)
return GetFib(i-1)+GetFib(i-2)
далее запращиваем с консоли число итераций 
Console.WriteLine("Задайте число итераций")
int i = Convert.ToInt32(Console.ReadLine())
int res = GetFib(i)
ну и финалим 
Console.WriteLine("Число Фибоначчи после {i} итераций = " + res)
привел то решение, что было самым логичным после вашего ответа на вопрос Андрею Галушко
Задание 5
Написать функцию, которая бы конвертировала число из римской системы в арабскую системы
Системой не пользовался в быту, сделал подсказку для себя в программе,
задачу решил частично, т.к. не удалось решить каким образом учесть умножение на 1000 с чертой над цифрой,
пробовал добавить слева от соответствующей цифры "/", но в этом случае ломается логика
попробую допилить в следующих сериях, 
еще есть мысль воспользоваться наработками из 2 задачи перевести римские цифры в string массив и попросить 
пользователя ввести элементы римской цифры через " ", сделать 2 string массива соответствий: 1 -  римские числа
2 - арабские, с расположением элементов по убыванию при нахождении во введенном с консоли массиве любого 
значения из римского массива определять его порядковый номер и возвращать значение из арабского массива
с тем же порядковым номером, далее сконвертировать циклом string элементы  массива в int и суммировать.
В такой схеме задавая, например, значения в формате "/L"= 50 000 можно сделать полную таблицу соответствий
и не ограничеваться возвращением максимальной суммой в 3999.

